In [1]:
import pandas as pd

In [3]:
dataset = pd.read_csv("C:\\Users\\sanjai kumar s\\Downloads\\employee_data.csv")
dataset

   EmployeeID     Name Department  Age   Salary JoiningDate Gender  Location
0         101    Alice         HR   29  50000.0  2015-06-01      F  New York
1         102      Bob         IT   35  70000.0  2013-04-21      M  San Jose
2         103  Charlie    Finance   30  65000.0  2016-03-12      M   Chicago
3         104    David         IT   40  85000.0  2011-11-30      M  New York
4         105      Eva         HR   28      NaN  2018-08-15      F   Chicago
5         106    Frank    Finance   38  72000.0  2014-07-19      M  San Jose
6         107    Grace         IT   32  69000.0  2017-05-23      F  New York
7         108    Alice         HR   29  50000.0  2015-06-01      F  New York

In [ ]:

print(dataset.shape)

(8, 8)

In [8]:
print(dataset.describe())

       EmployeeID        Age        Salary
count     8.00000   8.000000      7.000000
mean    104.50000  32.625000  65857.142857
std       2.44949   4.533605  12482.368518
min     101.00000  28.000000  50000.000000
25%     102.75000  29.000000  57500.000000
50%     104.50000  31.000000  69000.000000
75%     106.25000  35.750000  71000.000000
max     108.00000  40.000000  85000.000000

In [9]:
dataset.isna().any()

EmployeeID     False
Name           False
Department     False
Age            False
Salary          True
JoiningDate    False
Gender         False
Location       False
dtype: bool

In [4]:
print(dataset.head)

<bound method NDFrame.head of    EmployeeID     Name Department  Age   Salary JoiningDate Gender  Location
0         101    Alice         HR   29  50000.0  2015-06-01      F  New York
1         102      Bob         IT   35  70000.0  2013-04-21      M  San Jose
2         103  Charlie    Finance   30  65000.0  2016-03-12      M   Chicago
3         104    David         IT   40  85000.0  2011-11-30      M  New York
4         105      Eva         HR   28      NaN  2018-08-15      F   Chicago
5         106    Frank    Finance   38  72000.0  2014-07-19      M  San Jose
6         107    Grace         IT   32  69000.0  2017-05-23      F  New York
7         108    Alice         HR   29  50000.0  2015-06-01      F  New York>

In [5]:
print(dataset.tail)

<bound method NDFrame.tail of    EmployeeID     Name Department  Age   Salary JoiningDate Gender  Location
0         101    Alice         HR   29  50000.0  2015-06-01      F  New York
1         102      Bob         IT   35  70000.0  2013-04-21      M  San Jose
2         103  Charlie    Finance   30  65000.0  2016-03-12      M   Chicago
3         104    David         IT   40  85000.0  2011-11-30      M  New York
4         105      Eva         HR   28      NaN  2018-08-15      F   Chicago
5         106    Frank    Finance   38  72000.0  2014-07-19      M  San Jose
6         107    Grace         IT   32  69000.0  2017-05-23      F  New York
7         108    Alice         HR   29  50000.0  2015-06-01      F  New York>

In [18]:
print(dataset.loc[dataset['Age']>30])

   EmployeeID   Name Department  Age   Salary JoiningDate Gender  Location
1         102    Bob         IT   35  70000.0  2013-04-21      M  San Jose
3         104  David         IT   40  85000.0  2011-11-30      M  New York
5         106  Frank    Finance   38  72000.0  2014-07-19      M  San Jose
6         107  Grace         IT   32  69000.0  2017-05-23      F  New York